export interface LinkItem {
  label: string;
  link: string;
}

export interface Detail {
  type: string;
  items: (string | LinkItem)[];
}

export interface Category {
  title: string;
  details: Detail[];
}

const CategoryList = [
  {
    title: "회화",
    details: [
      {
        type: "테마",
        items: [
          "추상기법",
          "풍경",
          "자연",
          "인물",
          "일상",
          "대중 문화",
          "거리예술",
        ],
      },
      {
        type: "스타일",
        items: [
          "추상",
          "표현주의",
          "구상(具象)",
          "인상주의",
          "순수미술",
          "현실주의",
          "팝아트",
        ],
      },
      {
        type: "기법",
        items: ["아크릴", "유채", "스프레이", "콜라주", "잉크", "목탄", "안료"],
      },
    ],
  },
  {
    title: "조각",
    details: [
      {
        type: "테마",
        items: [
          "인물",
          "자연",
          "추상기법",
          "개념미술",
          "판타지",
          "동물",
          "누드",
        ],
      },
      {
        type: "스타일",
        items: [
          "독립된(free-standing) 조각품",
          "오브제",
          "벽 오브제",
          "야외 조각",
          "상반신",
          "Assemblage",
          "설치미술",
        ],
      },
      {
        type: "소재",
        items: ["청동", "철강", "레진", "목재", "아크릴", "석조", "알루미늄"],
      },
    ],
  },
  {
    title: "사진",
    details: [
      {
        type: "테마",
        items: ["순수미술", "풍경", "도시", "인물", "자연", "개념미술", "여행"],
      },
      {
        type: "스타일",
        items: [
          "색",
          "디지털",
          "현대",
          "흑백",
          "거리 사진",
          "파노라마",
          "세피아",
        ],
      },
      {
        type: "기법",
        items: ["디지털", "하이브리드", "필름 사진"],
      },
    ],
  },
  {
    title: "소묘",
    details: [
      {
        type: "테마",
        items: [
          "인물",
          "판타지",
          "추상기법",
          "풍경",
          "개념미술",
          "누드",
          "도시",
        ],
      },
      {
        type: "스타일",
        items: [
          "구상(具象)",
          "순수미술",
          "표현주의",
          "현실주의",
          "상징주의",
          "추상",
          "초현실주의",
        ],
      },
      {
        type: "기법",
        items: ["먹", "파스텔", "연필", "목탄", "펜", "색연필", "흑연"],
      },
    ],
  },
  {
    title: "인쇄",
    details: [
      {
        type: "테마",
        items: ["인물", "풍경", "판타지", "일상", "도시", "추상기법", "해양"],
      },
      {
        type: "스타일",
        items: [
          "팝아트",
          "구상(具象)",
          "만화",
          "현실주의",
          "추상",
          "빈티지",
          "순수미술",
        ],
      },
      {
        type: "기법",
        items: [
          "지 클립 인쇄",
          "석판화",
          "실크 스크린",
          "볼록판화",
          "판화",
          "모노타임",
        ],
      },
    ],
  },
  {
    title: "종이",
    details: [
      {
        type: "테마",
        items: [
          "추상기법",
          "인물",
          "풍경",
          "거리예술",
          "개념미술",
          "도시",
          "일상",
        ],
      },
      {
        type: "스타일",
        items: [
          "구상(具象)",
          "추상",
          "표현주의",
          "팝아트",
          "순수미술",
          "현실주의",
          "인상주의",
        ],
      },
      {
        type: "기법",
        items: ["아크릴", "수채", "콜라주", "안료", "먹", "연필", "잉크"],
      },
    ],
  },
  {
    title: "섬유 예술",
    details: [
      {
        type: "테마",
        items: ["추상기법", "정물", "동물", "인물", "도시", "풍경", "패션"],
      },
      {
        type: "스타일",
        items: [
          "추상",
          "표현주의",
          "구상(具象)",
          "기하학",
          "순수미술",
          "상징주의",
          "현실주의",
        ],
      },
      {
        type: "기법",
        items: ["면", "양모", "자수"],
      },
    ],
  },
];
export default CategoryList;
